# MaskCoincidentLines Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..MaskCoincidentLines Property
PDFExportOptions Class See Also
---
Whether to mask coincident lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool MaskCoincidentLines { get; set; }
```

Visual Basic
---
```text
Public Property MaskCoincidentLines As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool MaskCoincidentLines {
	bool get ();
	void set (bool value);
}
```

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace